Tekla.Structures.Internal.StructuresPluginDescriptor
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.StructuresPluginDescriptor._baseType
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.StructuresPluginDescriptor._userInterfaceDescription
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.StructuresPluginDescriptor._magicDict
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.StructuresPluginDescriptor.#ctor(System.String,System.String,System.Type,System.Collections.Generic.IDictionary{System.Type,System.Attribute[]})
DO NOT USE! For internal usage only!
name:
typeName:
baseType:
customAttributes:

Tekla.Structures.Internal.StructuresPluginDescriptor.CreateInstance(Tekla.Technology.Scripting.Invoker,Tekla.Structures.Internal.StructuresDataStorageBase)
DO NOT USE! For internal usage only!
invoker:
dataStorage:
Returns:

Tekla.Structures.Internal.StructuresPluginDescriptor.ReadParametersFromInstance(System.Object)
DO NOT USE! For internal usage only!
o:
Returns:

Tekla.Structures.Internal.StructuresPluginDescriptor.WriteParametersToInstance(System.Object)
DO NOT USE! For internal usage only!
o:
Returns:

Tekla.Structures.Internal.StructuresPluginDescriptor.FinishInstance(System.Object)
DO NOT USE! For internal usage only!
o:
Returns:

Tekla.Structures.Internal.StructuresPluginDescriptor.ToString
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.Internal.StructuresPluginDescriptor.Name
DO NOT USE! For internal usage only!

Tekla.Structures.Internal.StructuresPluginDescriptor.UserInterfaceDescription
DO NOT USE! For internal usage only!